
{
    "en": {
      "translation": {
        "Welcome": "Welcome!",
        "About": {
          "section": "About me",
          "intro": "<div>Hi, my name is Edgar, I am 23 years old and I am an application developer. I have been passionate about computer science since I was young and especially about video games. My goal is to work in the video game industry as a gameplay developer or as an engine developer.\n",
          "hobbies": {
            "title": "II) My interests",
            "progTitle": "Programming",
            "sciencesTitle": "Sciences",
            "prog": "Among the activities I enjoy, programming holds the gold medal, I love learning new languages and reinforcing my skills in those I already know. For me, programming is a series of challenges and puzzles to solve. I especially enjoy finding solutions to complex problems.",
            "sciences": "I am absolutely amazed by the sciences that represent for me the salvation of humanity ;). The areas I love the most, even though they often go far beyond my skills, are astronomy and everything related to space and the infinitely large. In a second time I love neurosciences and everything related to understanding the human brain and digitizing consciousness / mind. And finally I am also interested in quantum physics which plays a major role in the infinitely large and which contains so many mysteries.",
            "learning": "I love learning new things on various topics but I remain human above all, so yes, I also like playing video games, watching movies and series, and reading manga!"
          },
          "formation": {
            "title": "I) My journey",
            "motivation": "Having played video games when I was younger, I quickly found myself wanting to be on the other side of the mirror and create games, a way to tell stories and express my creativity in a more immersive and interactive way than conventional media.",
            "journey": "I started my studies in Lyon where I got my Bac + 2 (HND). Then, I continued in Rennes for my Bachelor's degree and I completed my journey in Montpellier with a Master's degree (Images and Games)."
          }
        },
        "CV": {
          "download": "Download",
          "skill": "Skills",
          "formation": "Education",
          "hobbies": "Hobbies"
        },
        "Contact": {
          "section": "Contact",
          "title1": "Contact",
          "title2": "Me!",
          "subtitle": "To contact me, use one of the following methods:",
          "tel": "+33 6 21 54 48 35",
          "email": "edgar.jacquemoud99@gmail.com",
          "github": "https://github.com/Nyuu-s",
          "linkedin": "www.linkedin.com/in/edgargamedev"
          
        },
        "Projects": {
          "section": "Projects",
          "lang" : "Technologies: ",
          "status" :{
            "on": "In progress..",
            "off": "Cancelled!",
            "hiatus": "On Hiatus",
            "done" : "Done."
          },
          "category": {
            "pers": {
              "default": "Personal",
              "games": "Games"
            },
            "uni": {
              "default": "Academic",
              "m1" : "Master's Degree 1",
              "m2" : "Master's Degree 2"
            },
            "work": {
              "default": "Business"
            },
            "special" : {
              "default": "Special"
            }
          },
          "1": {
            "title": "Code in Coop",
            "menutitle": "Code in Coop",
            "shortDesc": "A Minecraft mod made with a friend",
            "desc": "<div> The goal was to learn how Minecraft mods work while working as a team, unfortunately my friend and I got separated by our studies and so the project is now on hold. </div>"
            },
            "2": {
            "title": "Opengl base",
            "menutitle": "Opengl base",
            "shortDesc": "A basic rendering environment with Opengl",
            "desc": "<div> The goal was to discover and understand how rendering a simple scene works with OpenGL through the FreeCodeCamp tutorial. I later wanted to use it as a base for various exercises or projects without having to rewrite the basics every time. </div>"
            },
            "3": {
            "title": "Anime List",
            "menutitle": "Anime List",
            "shortDesc": "An application listing various series/animes and various statistics.",
            "desc": "<div> I created an application using Javascript and the front-end frameworks React and Electron to create a Windows application for listing series watched or to be watched, as well as available languages, release dates, and other information. Initially, this application was intended for a friend, but it will eventually be usable by everyone. </div>",
            "desc2": "<div> A customization interface tab has been set up to change colors as desired and the main theme (dark or light) </div>"
            },
            "4": {
            "title": "Infectious Engine",
            "menutitle": "Infectious Engine",
            "shortDesc": "A 3D/4D game engine",
            "desc": "<div> The goal of this project is to create a game engine that will, in a first step, experiment with various techniques, graphic APIs, code structures, and optimizations in order to better understand 3D game engines. Then, this engine will be used to run a first 3D game and a 4D game (4 spatial dimensions). Finally, I want to convert this engine to Rust to deepen my knowledge of this language that interests me. With the skills acquired through this project, I would like to create another engine (or use the one I have already developed) to make a game controlled by thought using an electroencephalography (EEG) headset. </div>"
            },
            "5": {
            "title": "Laby js",
            "menutitle": "Laby js",
            "shortDesc": "A maze generator",
            "desc": "<div> This is a small program written with the p5.js framework that generates a maze, the goal being to experiment with different algorithms including one using 'Backtrack' and another using recursive division of space. </div>"
            },
            "6": {
              "title": "Snowman Temple Run",
              "menutitle": "Temple Run",
              "shortDesc": "A university project consisting of creating a game engine and a game using this engine.",
              "desc": "<div>This is a university project I worked on with 2 of my classmates where the goal was to create a game engine with a game using this same engine. To do this, we used QT (C++) and OpenGl as a graphic API. Then, we chose to take the mobile game Temple Run, but on the theme of winter with a snowman. We also challenged ourselves to only move the background and obstacles and not the character. It's an endless game where the goal is to get the best score possible by avoiding ice. The three snowballs of the snowman represent the number of remaining lives, each obstacle removing one life. However, it is still possible to recover a snowball that falls from the walls when only one life is left.</div>",
              "desc2": "<div>In this project, I mainly set up the collision detection system, set up the texture systeme and participated in the architecture of the scene graph of the engine.</div>"
            },
            "7": {
              "title": "HDR Images",
              "menutitle": "HDR Images",
              "shortDesc": "A university project for an application to generate wide-range (HDR) images in astrophotography.",
              "desc": "<div>Our university project was to create an application that could take in a night sky image as input and apply different HDR algorithms to enhance it. My classmate and I used Qt to create an easy-to-use interface, and we implemented different HDR algorithms using openCV, such as those of Robertson, Debevec and Mertens. We also tested several methods to reduce noise, which is a common problem in astrophotography, first by averaging the images and then using a convolutional neural network. Finally, our results were quite satisfactory and we were able to develop an application that offered different options for tonal mapping and HDR algorithms to produce an enhanced image.</div>"
            },
            "8": {
              "title": "Augmented Reality Piano Assistant ARPA",
              "menutitle": "ARPA",
              "shortDesc": "A university project allowing playing the piano in augmented reality",
              "desc": "<div>This is a project I worked on with 2 of my classmates, using Unity and a LeapMotion to detect the user's hands. With certain hand movements, you can zoom in/out on the piano or move along it. With the help of different techniques, such as quantization, we were able to reduce the imprecisions of the sensors and thus reduce accidental errors, such as double taps. It is also possible to visualize what chords are being played. Here are some demonstration videos of the final application (in French).</div>"
            },
            "9": {
              "title": "Inpainting",
              "menuTitle": "Inpainting",
              "shortDesc": "A university project consisting of an application that performs image reconstruction.",
              "desc": "Our university project, done with a classmate, aims to develop an application that can take an image as input and select the areas to be repainted in order to reconstruct or erase elements of the image. Our initial approach is to calculate the average of the surrounding pixels. We also discovered another method called Fast Marching Method (FMM) that promises significantly better results while remaining performant, but we didn't have time to implement it. To select an area to paint, just click on a pixel of the image and change the sensitivity, that is, the color variance detection, using the mouse wheel."
            },
            "10": {
              "title": "Espelyet",
              "menuTitle": "Espelyet",
              "shortDesc": "A database project listing all web accessibility criteria.",
              "desc": "During my final internship, I developed a project aimed at preparing the development of an accessible website producing CMS. To do this, I created an application with a database that includes all accessibility criteria and an API that will allow this future CMS to request validations or recommendations regarding the user's ongoing production. Unfortunately, due to the nature of the project, I cannot show anything here."
            },
            "11": {
              "moreInfo": [
                "SmoothScrolling",
                "More interactions with the room. (including small games!)",
                "Transition effects between scenes",
                "UI improvement",
                "Completion of projects",
                "Different fixes for the mobile version"

              ],
              "moreInfoSubTitle": "Here's what's coming up next!",
              "title": "Portfolio",
              "menuTitle": "Portfolio",
              "shortDesc": "My 3D Portfolio",
              "desc": "A portfolio created with React and Three.js allowing me to learn about the functioning of WebGL while highlighting my other projects."
            },
            "12": {
              "title": "ULearning1",
              "menutitle": "ULearning1",
              "shortDesc": "My first 3D game, a small RPG where the player must kill a boss to finish the game",
              "desc": "<div>This is my first game made with Unreal Engine. The goal was to understand how to use Unreal by creating a simple game (but not so easy to finish haha) that will serve as a reference for future projects. The game is available for Windows in the git repository releases.</div>",
              "section1": "<div>All the assets used in this project are available for free. The game has a simple menu with no available options despite the presence of the button in the same menu. The character model is that of Echo from the Unreal Engine 5 demo. He can move in all directions and perform rolls, which allowed me to make animation montages.</div>",
              "section2": "<div>The player will encounter different types of enemies such as paladins, flying insects, and what looks like a big wolf. Paladins attack slowly and cause as much damage as the first weapon available to the player. Insects cause less damage but hit more quickly, and the wolf causes as much damage as the paladin, but is even faster than the insects, making it tough to beat (a bit too tough, even).</div>",
              "section3": "<div>The player can pick up several types of items, the first being the souls of the creatures killed, but also treasure by destroying various objects such as pots or statues (these two types of objects serve no purpose in this game). There is also another weapon causing 50 damage points. The most important are the different hearts: the red one gives 20 life points, the green one gives 10 extra maximum life points, the purple one sets the player's life to a certain value (in this level, there are 1 HP, 10 HP, and 50 HP, but no distinction between purple hearts is possible). Finally, the yellow hearts that give 200 maximum life points and restore 100 life points. </div>",
              "section4": "<div>I also briefly discovered Unreal's inverse kinematics by moving the character's legs and ankles on heights and slopes. If the player goes out of the map, the level restarts. </div>",
              "section5": "<div>The AI patrols around certain points and hunts the player within a certain radius. Once the boss is dead, the game is over. </div>"
            },
            "13": {
              "title": "ULearning2",
              "menutitle": "ULearning2",
              "shortDesc": "A multiplayer game",
              "desc": "<div>It is a game made with Unreal Engine 5 to understand how multiplayer works and many other features of the engine.</div>"
            }
          }
        } 
      },
      "fr": {
        "translation": {
          "Welcome": "Bienvenue !",
          "About" : {
            "section": "A propos de moi",
            "intro": "<div>Salut, je m'appelle Edgar, j'ai 23 ans et je suis développeur d'applications. Je suis passionné d'informatique depuis tout jeune et notamment de jeux vidéo. Mon objectif est de travailler dans le domaine du jeu vidéo en tant que développeur gameplay ou en tant que développeur moteur.\n ",
            "hobbies": {
              "title": "II) Mes centres d'intérêts",
              "progTitle": "Programmation",
              "sciencesTitle": "Sciences",
              "prog": "Parmi les activités que j'apprécie la programmation détient la médaille d'or, j'aime apprendre de nouveaux languages et renforcer mes compétences dans ceux que je connais déjà. Pour moi, la programmation consiste en une série de défis et d'énigmes à résoudre. J'aime particulièrement trouver des solutions à des problèmes complexes.",
              "sciences": "Je suis absolument émerveillé par les sciences qui représentent pour moi le salut de l'humanité ;). Les domaines que j'affectionne le plus, même si parfois cela dépasse de loin mes compétences sont dans un premier temps l'astronomie et tout ce qui concerne l'espace et l'infiniment grand. Dans un second temps j'aime les neurosciences et tout ce qui concernent la compréhension du cerveau humain et de la numérisation de la conscience / esprit. Et enfin je m'intéresse également à la physique quantique qui joue un rôle majeur dans l'infiniment grand et qui contient tellement de mystères.",
              "learning": "J'aime beaucoup apprendre de nouvelles choses sur des sujets variés mais je reste humain avant tout alors oui j'aime aussi jouer aux jeux vidéo, regarder des films et des series et lire des mangas !"
            },
            "formation": {
              "title": "I) Mon parcours",
              "motivation": "Ayant joué aux jeux vidéo étant plus jeune, je me suis assez vite retrouvé à vouloir être de l'autre côté du miroir et créer des jeux, une façon de raconter des histoires et d'exprimer ma créativité de manière plus immersive et interactive que les médias conventionnels.",
              "journey": "J'ai commencé mes études à Lyon où j'ai obtenu mon Bac+2. Ensuite, j'ai poursuivi à Rennes ma Licence et j'ai terminé mon cursus à Montpellier par un Master 2 (IMAGINE)."

            }

          },
          "CV": {
            "download": "Télécharger",
            "skill": "",
            "formation": "",
            "hobbies": ""
          },
          "Contact": {
            "section": "Contact",
            "title1": "Contactez",
            "title2": "Moi !",
            "subtitle": "Pour me contacter, utilisez l'un des moyens suivants :",
            "tel": "+33 6 21 54 48 35",
            "email": "edgar.jacquemoud99@gmail.com",
            "github": "https://github.com/Nyuu-s",
            "linkedin": "www.linkedin.com/in/edgargamedev"
            
          },
          "Projects": {
            "section": "Projets",
            "lang" : "Tecnologies: ",
            "status" :{
              "on": "En cours..",
              "off": "Annulé !",
              "hiatus": "En Pause",
              "done" : "Fini."
            },
            "category": {
              "pers": {
                "default": "Personnel",
                "games": "Jeux"
              },
              "uni": {
                "default": "Universitaire",
                "m1" : "Master 1",
                "m2" : "Master 2"
              },
              "work": {
                "default": "Entreprise"
              },
              "special" : {
                "default": "Spécial"
              }
            },
            "1": {
          
              "title" :"Code en Coop",
              "menutitle": "Code en Coop",
              "shortDesc" :"Un mode Minecraft fait avec un ami",
              "desc": "<div> L'objectif était de découvrir comment fonctionnent les mods de Minecraft tout en travaillant en équipe, malheureusement les études nous ont éloignées mon ami et moi et donc le projet est donc en pause.</div>"
            },
            "2": {
              "title" :"Opengl base",
              "menutitle" :"Opengl base",
              "shortDesc" :"Un environnement de rendu basique avec Opengl",
              "desc": "<div>L'objectif était de découvrir et comprendre comment fonctionne un simple rendu de scène avec OpenGL grâce au tutoriel de FreeCodeCamp. Je voulais par la suite m'en servir comme base pour différents exercices ou projets sans avoir besoin de réécrire les bases à chaque fois.</div>"
            },
            "3": {
              "title" :"Anime List",
              "menutitle" :"Anime List",
              "shortDesc" :"Une application listant les différentes séries / animes et diverses statistiques.",
              "desc": "<div> J'ai créé une application utilisant du Javascript et les frameworks front-end React et Electron afin de créer une application pour Windows permettant de lister les séries vues ou à voir, ainsi que les langues disponibles, les dates de sorties et d'autres informations. Au départ, cette application était destinée à une amie, mais elle sera finalement utilisable par tous.  </div>",
              "desc2": "<div> Un onglet de personnalisation d'interface a été mise en place pour changer les couleurs comme souhaité ainsi que le thème principal (sombre ou lumineux) </div>"
            },
            "4": {
              "title" :"Infectious Engine",
              "menutitle" :"Infectious Engine",
              "shortDesc" :"Un moteur de jeu 3D / 4D",
              "desc": "<div> Le but de ce projet est de créer un moteur de jeu qui permettra, dans un premier temps, d'expérimenter avec diverses techniques, API graphiques, structures de code et optimisations afin de mieux comprendre les moteurs de jeu 3D. Ensuite, ce moteur sera utilisé pour faire tourner un premier jeu 3D et un jeu en 4D (4 dimensions spatiales). Enfin, je souhaite convertir ce moteur en Rust pour approfondir mes connaissances sur ce langage qui m'intéresse. Grâce aux compétences acquises par ce projet, j'aimerai créer un autre moteur (ou utiliser celui que j'ai déjà développé) pour réaliser un jeu contrôlé par la pensée grâce à un casque d'électroencéphalogramme (EEG).  </div>"
            },
            "5": {
              "title" :"Laby js",
              "menutitle" :"Laby js",
              "shortDesc" :"Un générateur de labyrinthe",
              "desc": "<div>Il s'agit d'un petit programme écrit avec le framework p5.js permettant de générer un labyrinthe, l'objectif étant d'expérimenter différents algorithmes dont un utilisant le 'Backtrack' et un autre une division récursive de l'espace.</div> "
            },
            "6": {
              "title" :"Snowman Temple Run",
              "menutitle" :"Temple Run",
              "shortDesc" :"Un projet universitaire consistant en la création d'un moteur de jeu ainsi qu'un jeu utilisant ce moteur.",
              "desc": "<div>Il s'agit d'un projet universitaire réalisé avec 2 de mes camarades où l'objectif était de créer un moteur de jeu avec un jeu utilisant ce même moteur. Pour ce faire, nous avons utilisé QT (C++) et OpenGl comme API graphique. Ensuite, nous avons choisi de reprendre le jeu mobile Temple Run, mais sur le thème de l'hiver avec un bonhomme de neige. Nous nous sommes également imposé un petit défi, celui de déplacer uniquement le décor et les obstacles et non le personnage. C'est un jeu sans fin où le but est de faire le meilleur score possible en évitant les glaçons. Les trois boules de neige du bonhomme représentent le nombre de vies restantes, chaque obstacle enlevant une vie. Il est tout de même possible de récupérer une boule de neige qui tombe des parois lorsque l'on a plus qu'une seule vie.</div> ",
              "desc2": "<div> Dans ce projet, j'ai principalement mis en place le système de détection de collision et j'ai participé à l'architecture du graphe de scène du moteur.</div>"
            },
            "7": {
              "title" :"Images HDR",
              "menutitle" :"Images HDR",
              "shortDesc" :"Un projet universitaire d'application permettant de faire de la génération d'images à gamme large (HDR) en astrophotographie. ",
              "desc": "<div>Notre projet universitaire consistait à créer une application capable de prendre en entrée une image de ciel de nuit et d'appliquer différents algorithmes d'HDR pour l'améliorer. Mon camarade et moi avons utilisé Qt pour créer une interface facile à utiliser, et avons mis en place différents algorithmes d'HDR grâce à openCV, tels que ceux de Robertson, Debevec et Mertens. Nous avons également testé plusieurs méthodes pour réduire le bruit, qui est un problème courant en astrophotographie, en utilisant d'abord la moyenne des images et en utilisant par la suite un réseau de neurones convolutionnel. Finalement, nos résultats étaient assez satisfaisants et nous avons réussi à développer une application proposant différentes options de mappage ton-local et d'algorithmes HDR pour produire une image améliorée.</div> "
            },
            "8": {
              "title" :"Augmented Reality Piano Assistant ARPA",
              "menutitle" :"ARPA",
              "shortDesc" :"Un projet universitaire permettant de jouer du piano en réalité augmentée",
              "desc": "<div>C'est un projet réalisé avec 2 de mes camarades, sous Unity et avec un LeapMotion pour détecter les mains de l'utilisateur. Grâce à certains mouvements de main, on peut zoomer/dézoomer sur le piano ou se déplacer le long de celui-ci. Avec l'aide de différentes techniques, comme la quantification, nous avons pu réduire les imprécisions des capteurs et donc réduire les erreurs accidentelles, comme les touches doubles. Il est également possible de visualiser quels accords sont en train d'être joués. Voici quelques vidéos de démonstration de l'application finale (en français).</div> "
            },
            "9": {
              "title" :"Inpainting",
              "menutitle" :"Inpainting",
              "shortDesc" :"Un projet universitaire consistant en une application permettant de réaliser la reconstruction d'images.",
              "desc": "<div>Notre projet universitaire, réalisé avec un camarade, vise à développer une application qui peut prendre une image en entrée et sélectionner les zones à repeindre afin de reconstruire ou effacer des éléments de l'image. Notre approche initiale consiste à calculer la moyenne des pixels environnants. Nous avons également découvert une autre méthode appelée Fast Marching Methode (FMM) qui promet des résultats nettement supérieurs tout en restant performante, mais nous n'avons pas eu le temps de l'implémenter. Pour sélectionner une zone à peindre, il suffit de cliquer sur un pixel de l'image et de changer la sensibilité, c'est-à-dire la détection de variance de couleur, en utilisant la molette de la souris.</div> "
            },
            "10": {
              "title" :"Espelyet",
              "menutitle" :"Espelyet",
              "shortDesc" :"Un projet de base de données recensant tous les critères d'accessibilité du web",
              "desc": "<div>Pendant mon stage de fin d'étude, j'ai réalisé un projet visant à préparer le développement d'un CMS produisant des sites accessibles. Pour ce faire, j'ai créé une application avec une base de données comprenant tous les critères d'accessibilité et une API qui permettra à ce futur CMS de demander des validations ou des recommandations concernant la production en cours d'un utilisateur. Malheureusement, en raison de la nature du projet, je ne peux pas montrer quoi que ce soit ici. "
            },
            "11": {
              "moreinfo": ["SmoothScrolling", "Plus d'interactions avec la pièce. (dont des petits jeux !)","Effets de transitions entre les scènes", "Amélioration de l'UI", "Complétion des projets", "Différents fixs pour la version mobile"],
              "moreInfoSubTitle": "<div>Voici ce qui arrivera prochainement ! </div>",
              "title" :"Portfolio",
              "menutitle" :"Portfolio",
              "shortDesc" :"Mon Portfolio en 3D",
              "desc": "<div> Un portfolio créer avec react et Three.js permettant d'apprendre le fonctionnement de WebGL tout en mettant en valeurs mes autres projets. </div> "
            },
            "12": {
              "title" :"ULearning1",
              "menutitle" :"ULearning1",
              "shortDesc": "Mon premier jeu 3D, un petit RPG où le joueur doit tuer un boss pour finir le jeu",
              "desc": "<div>Il s'agit de mon premier jeu fait avec Unreal Engine. Le but était de comprendre comment utiliser Unreal en créant un jeu simple (mais pas si facile à finir haha) qui me servira de référence pour des futurs projets. Le jeu est disponible pour Windows dans les releases du dépôt git.</div>",
              "section1": "<div>Tous les assets utilisés dans ce projet sont disponibles gratuitement. Le jeu dispose d'un simple menu sans aucune option disponible malgré la présence du bouton dans ce même menu. Le modèle du personnage est celui d'Echo de la démo d'Unreal Engine 5. Il peut se déplacer dans toutes les directions et effectuer des roulades, ce qui m'a permis de faire des montages d'animations.</div>",
              "section2": "<div>Le joueur va rencontrer différents types d'ennemis tels que des paladins, des insectes volants et ce qui ressemble à un gros loup. Les paladins attaquent lentement et causent autant de dégâts que la première arme disponible pour le joueur. Les insectes causent moins de dégâts mais frappent plus rapidement, et le loup cause autant de dégâts que le paladin, mais est encore plus rapide que les insectes, ce qui le rend assez coriace à vaincre (un peu trop, même).</div>",
              "section3": "<div>Le joueur peut récupérer plusieurs types d'objets, le premier étant les âmes des créatures tuées, mais aussi les trésors en détruisant les différents objets tels que les pots ou les statues (ces deux types d'objets ne servent à rien dans ce jeu). Il existe également une autre arme causant 50 points de dégâts. Le plus important sont les différents cœurs: le rouge redonne 20 points de vie, le vert donne 10 points de vie maximum en plus, le violet redéfinit la vie du joueur à une certaine valeur (dans ce niveau, il y a 1 pv, 10 pv et 50 pv, mais aucune distinction entre les cœurs violets n'est possible). Enfin, les cœurs jaunes qui donnent 200 points de vie maximum et redonnent 100 points de vie. </div>",
              "section4": "<div>J'ai également pu découvrir brièvement l'inverse kinematics d'Unreal en déplaçant les jambes et les chevilles du personnage sur les hauteurs et les pentes. Si le joueur sort de la carte, le niveau recommence. </div>",
              "section5": "<div>Les IA patrouillent autour de certains points et chassent le joueur sur un certain rayon. Une fois le boss mort, le jeu est terminé. </div>"
            },
            "13": {
              "title" :"ULearning2",
              "menutitle" :"ULearning2",
              "shortDesc" :"Un jeu multijoueur",
              "desc": "<div> Il s'agit d'un jeu fait avec Unreal Engine pour comprendre comment fonctionne le multijoueur et de nombreuses autres fonctionnalités du moteur. </div> "
            }
          }

        }
      }
}

